package main

import (
	"fmt"
)

func main() {
	ch1:=make(chan int)
	go pump(ch1)
	fmt.Println(<-ch1) // 这里接收一次通道数据，并打印，但pump继续发后面的数时，没有别的接受者，发送端就阻塞，即没东西打印
	fmt.Println(<-ch1)
}

func pump(ch chan int) { // 将数据发送到通道ch1 (生产者)
	for i:=0;;i++ {
		ch<-i
	}
}

/*
例子中：一个协程不停地往通道发送int数据，但没有接收者，所以阻塞，并打印数字0

通道的发送 / 接收操作在对方准备好之前是阻塞的：
1）对于同一个通道，发送操作（协程或者函数中的），在接收者准备好之前是阻塞的：如果 ch 中的数据无人
接收，就无法再给通道传入其他数据：新的输入无法在通道非空的情况下传入。所以发送操作会等待 ch 再次
变为可用状态：就是通道值被接收时（可以传入变量）。
2）对于同一个通道，接收操作是阻塞的（协程或函数中的），直到发送者可用：如果通道中没有数据，接收者就阻塞了。
*/
